Update published date and add password change process
Updated published date and added password change process to the documentation.
